# BendDiameterDimensionsForSegmentsEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..BendDiameterDimensionsForSegmentsEnabled Property
RebarBendingDetailType Class See Also
---
Identifies if radial or diameter dimensions will be shown for the bends between segments. Radial or diameter dimesions for arc segments will be shown by default. This property has a menaning only if BendDiameterDimensionsEnabled is set to true.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool BendDiameterDimensionsForSegmentsEnabled { get; set; }
```

Visual Basic
---
```text
Public Property BendDiameterDimensionsForSegmentsEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool BendDiameterDimensionsForSegmentsEnabled {
	bool get ();
	void set (bool value);
}
```

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace